УНФ_ТЕСТ.BizOn_WMS_MES/src/InformationRegisters/СпецификацииПоУмолчанию/СпецификацииПоУмолчанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпецификацииПоУмолчанию</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>БЗ_WMS_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БЗ_ИспользоватьНазначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БЗ_MES_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособРасчетаЦеныНабора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоНабор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШиныИПокрышки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбувнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводителяВЕТИСПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧастичноеПогашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантПечатиНабора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидПродукцииИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТабачнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СредствоИндивидуальнойЗащиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодМедицинскогоИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АвтоматическиГенерироватьПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьИдентификаторПартииВЕТИСПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьЗаписьСкладскогоЖурналаВЕТИСПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьДатуПроизводстваПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТолькоПоддержкаОстаткаПриРасчетеПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочиванияУНФ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БЗ_РазрешитьВводБезШК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ.BizOn_WMS_MES/src/CommonModules/БЗ_Пакетирование/Module.bsl
Функция ПолучитьУпаковкиПродукции(Ссылка) Экспорт
	Если ЗначениеЗАполнено(ссылка.БЗ_ГлавныйЗаказ) Тогда
		  ГлавныйЗаказ=ссылка.БЗ_ГлавныйЗаказ;
	Иначе
		  ГлавныйЗаказ=ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
|	ЗаказПокупателяЗапасы.Количество КАК Количество,
|	&Рекл КАК Рекламация
|ПОМЕСТИТЬ ВТРекламационныеТовары
|ИЗ
|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
|ГДЕ
|	(ЗаказПокупателяЗапасы.Ссылка = &ГлавныйЗаказ
|			ИЛИ ЗаказПокупателяЗапасы.Ссылка.БЗ_ГлавныйЗаказ = &ГлавныйЗаказ)
|	И (ЗаказПокупателяЗапасы.Номенклатура В ИЕРАРХИИ (&Материалы)
|			ИЛИ ЗаказПокупателяЗапасы.Номенклатура В ИЕРАРХИИ (&Полуфабрикаты))
|	И ЗаказПокупателяЗапасы.Ссылка.ВидЗаказа.Наименование = ""Рекламация""
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЕСТЬNULL(ВТРекламационныеТовары.Рекламация, ЗаказПокупателяЗапасы.Номенклатура) КАК Номенклатура,
|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
|	ЗаказПокупателяЗапасы.Количество КАК Количество
|ПОМЕСТИТЬ ВтЗапасы
|ИЗ
|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРекламационныеТовары КАК ВТРекламационныеТовары
|		ПО (ЗаказПокупателяЗапасы.Номенклатура = ВТРекламационныеТовары.Номенклатура)
|			И (ЗаказПокупателяЗапасы.Характеристика = ВТРекламационныеТовары.Характеристика)
|ГДЕ
|	(ЗаказПокупателяЗапасы.Ссылка = &ГлавныйЗаказ
|			ИЛИ ЗаказПокупателяЗапасы.Ссылка.БЗ_ГлавныйЗаказ = &ГлавныйЗаказ)
|	И ЗаказПокупателяЗапасы.Ссылка.СостояниеЗаказа в(&Состояния)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	СпецификацииПоУмолчанию.Номенклатура КАК Номенклатура,
|	СпецификацииПоУмолчанию.Характеристика КАК Характеристика,
|	СпецификацииПоУмолчанию.Спецификация КАК Спецификация,
|	СУММА(ВтЗапасы.Количество) КАК Количество
|ПОМЕСТИТЬ ВтСпецификацииПоУмолчанию
|ИЗ
|	ВтЗапасы КАК ВтЗапасы
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииПоУмолчанию КАК СпецификацииПоУмолчанию
|		ПО ВтЗапасы.Номенклатура = СпецификацииПоУмолчанию.Номенклатура
|			И ВтЗапасы.Характеристика = СпецификацииПоУмолчанию.Характеристика
|ГДЕ
|	ВтЗапасы.Номенклатура.Изготовитель = &Основное
|
|СГРУППИРОВАТЬ ПО
|	СпецификацииПоУмолчанию.Характеристика,
|	СпецификацииПоУмолчанию.Спецификация,
|	СпецификацииПоУмолчанию.Номенклатура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЗаказПокупателяДополнительныеРеквизиты.Значение КАК Значение
|ПОМЕСТИТЬ ВТБезСтолешниц
|ИЗ
|	Документ.ЗаказПокупателя.ДополнительныеРеквизиты КАК ЗаказПокупателяДополнительныеРеквизиты
|ГДЕ
|	ЗаказПокупателяДополнительныеРеквизиты.Свойство.Имя = ""МИФ_БезСтолешниц""
|	И ЗаказПокупателяДополнительныеРеквизиты.Ссылка = &ГлавныйЗаказ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтСпецификацииПоУмолчанию.Номенклатура КАК Номенклатура,
|	ВтСпецификацииПоУмолчанию.Характеристика КАК ХарактеристикаНоменклатуры,
|	СУММА(ВтСпецификацииПоУмолчанию.Количество) КАК КоличествоИзделий,
|	СпецификацииСостав.Номенклатура КАК Пакет,
|	СпецификацииСостав.Характеристика КАК ХарактеристикаПакета,
|	СУММА(СпецификацииСостав.Количество * ВтСпецификацииПоУмолчанию.Количество) КАК Количество
|ПОМЕСТИТЬ ВтУпаковкиПродукции
|ИЗ
|	ВтСпецификацииПоУмолчанию КАК ВтСпецификацииПоУмолчанию
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спецификации.Состав КАК СпецификацииСостав
|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБезСтолешниц КАК ВТБезСтолешниц
|			ПО (ИСТИНА)
|		ПО ВтСпецификацииПоУмолчанию.Спецификация = СпецификацииСостав.Ссылка
|ГДЕ
|	ВЫБОР
|			КОГДА ЕСТЬNULL(ВТБезСтолешниц.Значение, ЛОЖЬ)
|				ТОГДА НЕ СпецификацииСостав.Номенклатура В ИЕРАРХИИ (&Столешницы)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И СпецификацииСостав.Номенклатура.Родитель.Код <> ""НФ-00000039""
|
|СГРУППИРОВАТЬ ПО
|	СпецификацииСостав.Номенклатура,
|	СпецификацииСостав.Характеристика,
|	ВтСпецификацииПоУмолчанию.Номенклатура,
|	ВтСпецификацииПоУмолчанию.Характеристика
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтЗапасы.Номенклатура КАК Номенклатура,
|	ВЫБОР
|		КОГДА ВтЗапасы.Номенклатура = &Рекл
|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
|		ИНАЧЕ ВтЗапасы.Характеристика
|	КОНЕЦ КАК Характеристика,
|	СУММА(ВтЗапасы.Количество) КАК Количество
|ПОМЕСТИТЬ ВтУпаковки
|ИЗ
|	ВтЗапасы КАК ВтЗапасы
|ГДЕ
|	ВтЗапасы.Номенклатура.Изготовитель <> &Основное
|
|СГРУППИРОВАТЬ ПО
|	ВтЗапасы.Номенклатура,
|	ВЫБОР
|		КОГДА ВтЗапасы.Номенклатура = &Рекл
|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
|		ИНАЧЕ ВтЗапасы.Характеристика
|	КОНЕЦ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	втУпаковкиПродукции.Номенклатура КАК Номенклатура,
|	втУпаковкиПродукции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
|	втУпаковкиПродукции.КоличествоИзделий КАК КоличествоИзделий,
|	втУпаковкиПродукции.Пакет КАК Пакет,
|	втУпаковкиПродукции.ХарактеристикаПакета КАК ХарактеристикаПакета,
|	втУпаковкиПродукции.Количество КАК Количество
|ПОМЕСТИТЬ ВтРезультат
|ИЗ
|	ВтУпаковкиПродукции КАК втУпаковкиПродукции
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВтУпаковки.Номенклатура,
|	ВтУпаковки.Характеристика,
|	ВтУпаковки.Количество,
|	ВтУпаковки.Номенклатура,
|	ВтУпаковки.Характеристика,
|	ВтУпаковки.Количество
|ИЗ
|	ВтУпаковки КАК ВтУпаковки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтЗапасы.Номенклатура КАК Номенклатура,
|	ВтЗапасы.Характеристика КАК ХарактеристикаНоменклатуры,
|	ВтЗапасы.Количество КАК КоличествоИзделий,
|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Пакет,
|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаПакета,
|	ВтЗапасы.Количество КАК Количество
|ПОМЕСТИТЬ ВТФурнитура
|ИЗ
|	ВтЗапасы КАК ВтЗапасы
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
|		ПО ВтЗапасы.Номенклатура = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец
|			И ВтЗапасы.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Ссылка
|ГДЕ
|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Имя = ""КомплектФурнитуры""
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтРезультат.Номенклатура КАК Номенклатура,
|	ВтРезультат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
|	СУММА(ВтРезультат.КоличествоИзделий) КАК КоличествоИзделий,
|	ВтРезультат.Пакет КАК Пакет,
|	ВтРезультат.ХарактеристикаПакета КАК ХарактеристикаПакета,
|	СУММА(ВтРезультат.Количество) КАК Количество
|ПОМЕСТИТЬ втрез
|ИЗ
|	ВтРезультат КАК ВтРезультат
|ГДЕ
|	ВтРезультат.Пакет.Изготовитель <> &Основное
|	И ВтРезультат.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
|
|СГРУППИРОВАТЬ ПО
|	ВтРезультат.Номенклатура,
|	ВтРезультат.ХарактеристикаНоменклатуры,
|	ВтРезультат.Пакет,
|	ВтРезультат.ХарактеристикаПакета
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТФурнитура.Номенклатура,
|	ВТФурнитура.ХарактеристикаНоменклатуры,
|	ВТФурнитура.КоличествоИзделий,
|	ВТФурнитура.Пакет,
|	ВТФурнитура.ХарактеристикаПакета,
|	ВТФурнитура.Количество
|ИЗ
|	ВТФурнитура КАК ВТФурнитура
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	втрез.Номенклатура КАК Номенклатура,
|	втрез.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
|	ВЫБОР
|		КОГДА втрез.Номенклатура = &Рекл
|			ТОГДА 1
|		ИНАЧЕ втрез.КоличествоИзделий
|	КОНЕЦ КАК КоличествоИзделий,
|	втрез.Пакет КАК Пакет,
|	втрез.ХарактеристикаПакета КАК ХарактеристикаПакета,
|	ВЫБОР
|		КОГДА втрез.Номенклатура = &Рекл
|			ТОГДА 1
|		ИНАЧЕ втрез.Количество
|	КОНЕЦ КАК Количество
|ИЗ
|	втрез КАК втрез";

	
		Состояния= Новый массив();
		состояния.Добавить(Справочники.СостоянияЗаказовПокупателей.НайтиПоНаименованию("В наборке"));
		Состояния.Добавить(Справочники.СостоянияЗаказовПокупателей.НайтиПоНаименованию("Завершен"));
	    Запрос.УстановитьПараметр("Состояния",состояния);
		Запрос.УстановитьПараметр("Столешницы", Справочники.Номенклатура.НайтиПоКоду("НФ-00001319"));
		Запрос.УстановитьПараметр("Рекл", Справочники.Номенклатура.НайтиПоКоду("НФ-0006240"));
		Запрос.УстановитьПараметр("Полуфабрикаты", Справочники.Номенклатура.НайтиПоКоду("НФ-00000003"));
		Запрос.УстановитьПараметр("Материалы", Справочники.Номенклатура.НайтиПоКоду("НФ-00000013"));
		Запрос.УстановитьПараметр("ГлавныйЗаказ", ГлавныйЗаказ);	
	Запрос.УстановитьПараметр("Основное", Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Основное"));
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции
